2020/latex-summary.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2021-03-07 周日 15:57 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>LaTeX 学习小结</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">LaTeX 学习小结</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org12218a9">1. 前言</a></li>
<li><a href="#org2331ec5">2. 基本概念</a></li>
<li><a href="#orgc71cf27">3. 字体相关</a></li>
<li><a href="#org94560d3">4. 相关问题</a>
<ul>
<li><a href="#org1f15c6b">4.1. LaTeX 和 TeX 的区别是什么？</a></li>
<li><a href="#org9596a01">4.2. plain TeX 又是什么东西？</a></li>
<li><a href="#orgdea276c">4.3. .cls 和 .sty 文件之间的区别</a></li>
<li><a href="#orgfa8d39f">4.4. 如何在 LaTeX 中使用中文</a></li>
<li><a href="#orgc4b31ce">4.5. 命令和环境的区别</a></li>
</ul>
</li>
<li><a href="#orgf521fd4">5. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-org12218a9" class="outline-2">
<h2 id="org12218a9"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
数次试图入坑 LaTeX，但是都因为 LaTex 中各种复杂的概念被劝退，但是，在前两天，我感觉我似乎成功入坑了，所以，准备把我入坑过程中遇到的问题总结下来。
</p>

<p>
因此，这篇博客的内容不会涉及到多少 LaTeX 语法上的东西 ‍(｀・ω・´)
</p>
</div>
</div>

<div id="outline-container-org2331ec5" class="outline-2">
<h2 id="org2331ec5"><span class="section-number-2">2</span> 基本概念</h2>
<div class="outline-text-2" id="text-2">
<p>
首先需要明白的是，TeX(LaTeX) 是一个页面排版系统，因此除了 TeX 这个标记语言本身以外，还涉及到了一些其他更底层的东西，比如说光栅图像处理器 RIP 和页面描述语言 PDL。
</p>

<p>
RIP 是数字排版中的一个重要概念，可以是硬件、固件和软件，通过 RIP 生成的点阵图像可以输出到激光照排机或直接制版机等制版设备，也可以输出到打印机。而 PDL 可以作为 RIP 的输入，用来控制 RIP 的输出，生成我们想要的页面排版效果。
</p>

<p>
但是 PDL 太底层了，即不适合阅读，也不适合编写，因此，往往还会在 PDL 外面再加一层标记语言，方便阅读和编写。而 TeX 就是这样一种标记语言。学习 TeX 时常见的如 LuaTeX、XeTeX 便是用来将 TeX 编译为页面描述语言的引擎，等价于我们在编译型语言中使用的编译器。
</p>

<p>
另外，TeX 引擎的输出往往是 DVI 格式，这是一种特殊的设备无关的页面描述语言<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>，不能嵌入字体和图像，因此，往往还需要某种 <b>驱动</b> 程序来将 DVI 转换为其他页面描述语言，比如 PostScript。
</p>

<p>
类比 TeX 和 C 语言的使用过程便是：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">TeX</th>
<th scope="col" class="org-left">C 语言</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">使用 TeX 编写文档</td>
<td class="org-left">使用 C 语言编写源代码</td>
</tr>

<tr>
<td class="org-left">使用 TeX 引擎将 TeX 编译为页面描述语言 DVI</td>
<td class="org-left">将 C 编译为汇编代码</td>
</tr>

<tr>
<td class="org-left">使用 TeX 驱动将 DVI 转换为其他页面描述语言</td>
<td class="org-left">将汇编代码编译为机器码</td>
</tr>

<tr>
<td class="org-left">将页面描述语言作为 RIP 的输入生成最终结果</td>
<td class="org-left">将机器码作为计算机的输入运行</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc71cf27" class="outline-2">
<h2 id="orgc71cf27"><span class="section-number-2">3</span> 字体相关</h2>
<div class="outline-text-2" id="text-3">
<p>
作为想要使用 LaTeX 的中文选手，避不开的一个问题就是中文的使用，虽然可以通过 CTEX 宏包解决中文问题，但还是需要理解一些字体相关的概念。
</p>

<p>
简单来说，就是我们编写的文档往往并没有直接定义文本和图像的表现形式，其中，文本的表现形式往往是存储在 <b>字体文件</b> 中的，而字体文件本身就是与页面排版系统密切相关的一种文件，理解是可以区分为三种层次：
</p>
<ul class="org-ul">
<li>编码层 - 通过索引定义了字符集，通过二进制编码定义了字符编码格式</li>
<li>格式层 - 定义了字形的描述方法和字体文件的存储格式</li>
<li>显示层 - 字体的外在表现形式</li>
</ul>

<p>
而编码层，对应的就是我们编写 TeX 文档时这一层，保存的文件便包含了字符的二进制编码，然后在编译时，可以通过对应的字体格式得到字体字形的描述，然后输出显示到屏幕上。
</p>

<p>
其中，早期的 LaTeX 引擎往往需要有字体文件对应的 <code>tfm</code> 文件才能使用该字体，但是，XeTeX 可以不需要 <code>tfm</code> 文件，因此，想简单点的话，写中文还是用 <code>XeTeX</code> 引擎好了。
</p>

<p>
参考：
</p>
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/TeX_font_metric">TeX font metric - Wikipedia</a></li>
<li><a href="https://zh.wikipedia.org/wiki/OpenType">OpenType - 维基百科，自由的百科全书</a></li>
<li><a href="https://zh.wikipedia.org/wiki/TrueType">TrueType - 维基百科，自由的百科全书</a></li>
</ul>
</div>
</div>

<div id="outline-container-org94560d3" class="outline-2">
<h2 id="org94560d3"><span class="section-number-2">4</span> 相关问题</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org1f15c6b" class="outline-3">
<h3 id="org1f15c6b"><span class="section-number-3">4.1</span> LaTeX 和 TeX 的区别是什么？</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<code>TeX</code> 是一个由美国计算机教授高德纳<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>发明的标记语言（排版软件），通过各种命令来控制页面输出，比如：
</p>
<div class="org-src-container">
<pre class="src src-tex">Hello, World
<span class="org-keyword">\bye</span>          <span class="org-comment">% marks the end of the file; not shown in the final output</span>
</pre>
</div>

<p>
而 <code>LaTeX</code> 是一个通过 <code>TeX</code> 编写的宏包，提供了很多预设的模版和样式，能够让我们能够更加容易的编写文档，格式往往类似：
</p>
<div class="org-src-container">
<pre class="src src-tex"><span class="org-keyword">\documentclass</span>[a4paper]{<span class="org-builtin">book</span>}
<span class="org-keyword">\begin</span>{<span class="org-function-name">document</span>}
<span class="org-keyword">\section</span>{<span class="org-function-name"> ... a title </span>}
<span class="org-keyword">\subsection</span>{<span class="org-function-name"> ... a subtitle</span>}
<span class="org-comment-delimiter">%% </span><span class="org-comment">Text goes here</span>
<span class="org-keyword">\end</span>{<span class="org-function-name">document</span>}
</pre>
</div>

<p>
因此，LaTeX 和 TeX 之间的关系就像是 Java 语言和各种依赖包之间的关系一样，参考：
</p>
<ul class="org-ul">
<li><a href="https://www.zhihu.com/question/49681542">LaTeX 与 TeX 有什么本质区别？ - 知乎</a></li>
<li><a href="https://zh.wikipedia.org/wiki/TeX">TeX - 维基百科，自由的百科全书</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9596a01" class="outline-3">
<h3 id="org9596a01"><span class="section-number-3">4.2</span> plain TeX 又是什么东西？</h3>
<div class="outline-text-3" id="text-4-2">
<p>
TeX 是一种标记语言，也是一种宏语言，当你制作了一些特别基础的宏，那么你可以将其发布为一个格式，plain TeX 便是高纳德创建的一种格式，LaTeX 则是现在使用的最为广泛的格式。
</p>

<p>
使用类似 <code>XeLaTeX</code> 的命令时其实便等价于 <code>XeTeX -fmt=latex</code> 的简写。
</p>
</div>
</div>

<div id="outline-container-orgdea276c" class="outline-3">
<h3 id="orgdea276c"><span class="section-number-3">4.3</span> .cls 和 .sty 文件之间的区别</h3>
<div class="outline-text-3" id="text-4-3">
<p>
这两种文件没有本质上的区别，在 LaTeX 升级之前其实只有 .sty 这一种文件，因为，所有的 TeX 宏包某种程度上来说都是为了样式服务的，但是由于 LaTeX 中往往只会加载一个 documentclass，因此，后来单独分了一个后缀名 <code>.cls</code> 来存在 documentclass。
</p>

<p>
使用时，往往是通过 <code>\documentclass{}</code> 加载一个类文件，且只能加载一次，并通过 <code>\usepackage{}</code> 加载任意数量的其他宏包。
</p>

<p>
两者文件的编写原则：
</p>
<ul class="org-ul">
<li>如果一个命令是用来控制文档结构的，则应该放到类文件中，否则应该放到包文件中</li>
<li>如果一个命令可以被其他所有的文档使用，那么将这个命令放置到一个包中，如果不是，则将它放到一个类文件中</li>
<li>当一个命令使上述两条规则冲突的时候，优先考虑第一条规则。如 <code>\section</code> 命令几乎在所有的文档中都使用，但因为其是用来控制文档结构的，我们将其放置到类文件中</li>
</ul>

<p>
参考：
</p>
<ul class="org-ul">
<li><a href="https://www.jianshu.com/p/12b4a4b3afce">latex 中 cls 和 sty 文件 - 简书</a></li>
<li><a href="https://tex.stackexchange.com/questions/97418/sty-suffix-extension-for-latex-packages/97420">texmf - .sty suffix (extension) for LaTeX packages - TeX - LaTeX Stack Exchange</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfa8d39f" class="outline-3">
<h3 id="orgfa8d39f"><span class="section-number-3">4.4</span> 如何在 LaTeX 中使用中文</h3>
<div class="outline-text-3" id="text-4-4">
<p>
在 LaTeX 中使用中文的简单方案是使用 CTEX 宏包和 xelatex 引擎，其中，CTEX 宏包提供了简便的 ctexart、ctexrep、ctexbook 和 ctexbemer 文档类，但是如果想使用其他的文档类的话，也可以单独使用 ctex 宏包。
</p>

<div class="org-src-container">
<pre class="src src-latex"><span class="org-keyword">\usepackage</span>[UTF8]{<span class="org-builtin">ctex</span>}
</pre>
</div>

<p>
还可以通过 <code>heading</code> 选项开启中文风格的标题：
</p>
<div class="org-src-container">
<pre class="src src-latex"><span class="org-keyword">\usepackage</span>[UTF8, heading = true]{<span class="org-builtin">ctex</span>}
</pre>
</div>

<p>
其中，CTEX 宏包会使用 CJK 字体集，CJK 的含义是中日韩统一表意文字在电脑的所有字体列表，参考：
</p>
<ul class="org-ul">
<li><a href="https://zh.wikipedia.org/wiki/CJK%E5%AD%97%E4%BD%93%E5%88%97%E8%A1%A8">CJK 字体列表 - 维基百科，自由的百科全书</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc4b31ce" class="outline-3">
<h3 id="orgc4b31ce"><span class="section-number-3">4.5</span> 命令和环境的区别</h3>
<div class="outline-text-3" id="text-4-5">
<p>
命令通常用来来控制 LaTeX 文档的行为，常见的格式为：
</p>
<div class="org-src-container">
<pre class="src src-tex"><span class="org-keyword">\commandname</span>[optional argument]{main argument}

<span class="org-comment-delimiter">% </span><span class="org-comment">&#22810;&#20010;&#21442;&#25968;</span>
<span class="org-keyword">\multicolumn</span>{number of columns joined}{alignment}{content} 
</pre>
</div>

<p>
还有一些命令可以不要参数：
</p>
<div class="org-src-container">
<pre class="src src-tex"><span class="org-keyword">\item</span> Text being item content
</pre>
</div>

<p>
环境是一种特殊的命令，也可以有参数和选项，常见格式为：
</p>
<div class="org-src-container">
<pre class="src src-tex"><span class="org-keyword">\begin</span>{<span class="org-function-name">environmentname</span>}
  content
<span class="org-keyword">\end</span>{<span class="org-function-name">environmentname</span>}
</pre>
</div>

<p>
参考：
</p>
<ul class="org-ul">
<li><a href="https://www.overleaf.com/learn/latex/Commands_and_environments">Commands and environments - Overleaf, Online LaTeX Editor</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf521fd4" class="outline-2">
<h2 id="orgf521fd4"><span class="section-number-2">5</span> 结语</h2>
<div class="outline-text-2" id="text-5">
<p>
总的来说的话，LaTeX 本身的语法并不难，但是，学习的时候经常就是一堆概念糊到你脸上，让人有些措手不及。
</p>

<p>
希望，这次理清了一些概念后后续的学习能够轻松一点。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
准确来说只能算是准页面描述语言 
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
《计算机程序设计艺术》的作者，我喜欢叫他高祖，拥有个人 <a href="https://en.wikipedia.org/wiki/The_Art_of_Computer_Programming">维基百科页面</a> 的大佬
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<script src="https://utteranc.es/client.js"
        repo="rgb-24bit/blog"
        issue-term="pathname"
        theme="boxy-light"
        crossorigin="anonymous"
        async>
</script>
</div>
</body>
</html>
